In [1]:
import pandas as pd

In [4]:
subsidies = pd.read_csv("../data_clean/subsidies.csv")
students = pd.read_csv("../data_clean/students.csv")
demographics = pd.read_csv("../data_clean/demographics.csv")

In [5]:
subsidies.info()

<class 'pandas.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   subsidy_year   12 non-null     int64
 1   Care           11 non-null     float64
 2   Education      12 non-null     float64
 3   education_yoy  11 non-null     float64
 4   care_yoy       10 non-null     float64
 5   t              12 non-null     int64
 6   edu_lag1       11 non-null     float64
 7   edu_lag2       10 non-null     float64
 8   care_lag1      10 non-null     float64
 9   care_lag2      9 non-null      float64
 10  edu_roll3      10 non-null     float64
 11  care_roll3     9 non-null      float64
dtypes: float64(10), int64(2)
memory usage: 1.3 KB

In [6]:
demographics.info()

<class 'pandas.DataFrame'>
RangeIndex: 3566 entries, 0 to 3565
Data columns (total 36 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   Districts & Neigbourhoods               3566 non-null   str
 1   Type of region                          3566 non-null   str
 2   Regioncode                              3566 non-null   str
 3   Total population                        3566 non-null   float64
 4   Man                                     3566 non-null   float64
 5   Woman                                   3566 non-null   float64
 6   Population| Age group |0 tot 15 year    3566 non-null   float64
 7   Population| Age group |15 tot 25 year   3566 non-null   float64
 8   Population| Age group |25 tot 45 year   3566 non-null   float64
 9   Population| Age group |45 tot 65 year   3566 non-null   float64
 10  Population| Age group |65+ year         3566 non-null   float64
 11  Births                                  3566 non-null   float64
 12  Deaths                                  3566 non-null   float64
 13  Total households                        3566 non-null   float64
 14  Single-person households                3566 non-null   float64
 15  Households without children             3566 non-null   float64
 16  Households with children                3566 non-null   float64
 17  Average household size                  3566 non-null   float64
 18  Care|Young people receiving youth care  3566 non-null   float64
 19  Healthcare|Wmo clients                  3566 non-null   float64
 20  ZIPcode                                 3566 non-null   float64
 21  Year                                    3566 non-null   int64
 22  children_0_15                           3566 non-null   float64
 23  youth_15_25                             3566 non-null   float64
 24  families_children                       3566 non-null   float64
 25  elderly_65_plus                         3566 non-null   float64
 26  single_households_ind                   3566 non-null   float64
 27  youth_care_users                        3566 non-null   float64
 28  wmo_users                               3566 non-null   float64
 29  youth_care_rate                         3433 non-null   float64
 30  wmo_rate                                3433 non-null   float64
 31  children_0_15_growth                    2488 non-null   float64
 32  youth_15_25_growth                      2509 non-null   float64
 33  elderly_65_plus_growth                  2508 non-null   float64
 34  families_children_growth                2481 non-null   float64
 35  single_households_ind_growth            2560 non-null   float64
dtypes: float64(32), int64(1), str(3)
memory usage: 1.1 MB

In [8]:
students.info()

<class 'pandas.DataFrame'>
RangeIndex: 98 entries, 0 to 97
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   education_type  98 non-null     str
 1   year            98 non-null     int64
 2   students        98 non-null     int64
dtypes: int64(2), str(1)
memory usage: 5.1 KB

In [9]:
students.head()

                                   education_type  year  students
0                              Primary education   2012     61180
1  Secundary eduction for special needs childeren  2012      2810
2                             Secundary education  2012     32950
3                  Secundary education for adults  2012       360
4                            Vocational education  2012     18760